### Manejo de base de datos

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'2.0.1'

### Creacion de bases de datos

In [4]:
Diccionario = {'a':[1,2,3],'b':[2,1,3],'c':[3,1,2]}

In [5]:
Base1 = pd.DataFrame(Diccionario)

In [7]:
Base1

   a  b  c
0  1  2  3
1  2  1  1
2  3  3  2

In [8]:
Base2 = pd.DataFrame(Diccionario, index = ['N','M','L'])

In [9]:
Base2

   a  b  c
N  1  2  3
M  2  1  1
L  3  3  2

In [10]:
Base3 = pd.DataFrame(Diccionario, index = ['N','M','L'], columns = ['a','b'])

In [11]:
Base3

   a  b
N  1  2
M  2  1
L  3  3

In [12]:
Matriz = np.array([[1,2,3],[4,5,6]])

In [13]:
Base4 = pd.DataFrame(Matriz)

In [14]:
Base4

   0  1  2
0  1  2  3
1  4  5  6

In [15]:
Base5 = pd.DataFrame([1,2,3])

In [16]:
Base5

   0
0  1
1  2
2  3

In [17]:
Base6 = pd.DataFrame([[1,2,3],[4,5,6]])

In [18]:
Base6

   0  1  2
0  1  2  3
1  4  5  6

In [19]:
Base7 = pd.DataFrame([[[1,2,3],[4,5,6]],[[7,8,9],[10,11,12]]])

In [20]:
Base7

           0             1
0  [1, 2, 3]     [4, 5, 6]
1  [7, 8, 9]  [10, 11, 12]

###### Series vs dataframe

In [25]:
Base7

           0             1
0  [1, 2, 3]     [4, 5, 6]
1  [7, 8, 9]  [10, 11, 12]

In [24]:
Base7[0]

0    [1, 2, 3]
1    [7, 8, 9]
Name: 0, dtype: object

In [21]:
Base7[[0,1]]

           0             1
0  [1, 2, 3]     [4, 5, 6]
1  [7, 8, 9]  [10, 11, 12]